#### Terraform Format and Style 🖌️ `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`
#### Terraform Workspace 🌍 `staging`

<details><summary>Show Plan Output</summary>

```terraform
Acquiring state lock. This may take a few moments...
neon_project.main: Refreshing state... [id=old-wave-64591209]
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/polycloudops/locations/global/workloadIdentityPools/gh-pool-staging]
google_compute_network.main_vpc: Refreshing state... [id=projects/polycloudops/global/networks/polycloudops-vpc-staging]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=polycloudops/artifactregistry.googleapis.com]
google_project_service.required_apis["iam.googleapis.com"]: Refreshing state... [id=polycloudops/iam.googleapis.com]
google_project_service.required_apis["secretmanager.googleapis.com"]: Refreshing state... [id=polycloudops/secretmanager.googleapis.com]
google_project_service.required_apis["storage.googleapis.com"]: Refreshing state... [id=polycloudops/storage.googleapis.com]
google_project_service.required_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=polycloudops/cloudresourcemanager.googleapis.com]
google_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=polycloudops/run.googleapis.com]
google_project_service.required_apis["compute.googleapis.com"]: Refreshing state... [id=polycloudops/compute.googleapis.com]
google_service_account_iam_member.wif_binding: Refreshing state... [id=projects/polycloudops/serviceAccounts/terraform-sa@polycloudops.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/173389596894/locations/global/workloadIdentityPools/gh-pool-staging/attribute.repository/brendanPro/poly-cloudops]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/polycloudops/locations/global/workloadIdentityPools/gh-pool-staging/providers/github-provider]
google_compute_subnetwork.public_subnet: Refreshing state... [id=projects/polycloudops/regions/europe-west1/subnetworks/polycloudops-public-subnet-staging]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/polycloudops/global/firewalls/polycloudops-allow-internal-staging]
neon_role.n8n_user: Refreshing state... [id=old-wave-64591209/br-falling-leaf-aeroevr7/n8n_app_user]
google_secret_manager_secret_version.db_host: Refreshing state... [id=projects/173389596894/secrets/db-host/versions/19]
neon_database.n8n_db: Refreshing state... [id=old-wave-64591209/br-falling-leaf-aeroevr7/n8n_db]
google_secret_manager_secret_version.db_user: Refreshing state... [id=projects/173389596894/secrets/db-user/versions/16]
google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/173389596894/secrets/db-password/versions/16]
google_secret_manager_secret_version.db_connection_string: Refreshing state... [id=projects/173389596894/secrets/n8n-db-connection-string/versions/18]
google_secret_manager_secret_version.db_database: Refreshing state... [id=projects/173389596894/secrets/db-database/versions/16]
postgresql_default_privileges.public_schema: Refreshing state... [id=n8n_app_user_n8n_db_public_n8n_app_user_table]
null_resource.create_translations_table: Refreshing state... [id=596672327568931296]
google_service_account.cloudrun_sa: Refreshing state... [id=projects/polycloudops/serviceAccounts/n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_storage_bucket.n8n_storage[0]: Refreshing state... [id=polycloudops-n8n-storage-staging]
google_secret_manager_secret_iam_member.db_database_access: Refreshing state... [id=projects/polycloudops/secrets/db-database/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_project_iam_member.cloudrun_sa_metric_writer: Refreshing state... [id=polycloudops/roles/monitoring.metricWriter/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_project_iam_member.cloudrun_sa_log_writer: Refreshing state... [id=polycloudops/roles/logging.logWriter/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_user_access: Refreshing state... [id=projects/polycloudops/secrets/db-user/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_service_account_iam_member.cloudrun_sa_user: Refreshing state... [id=projects/polycloudops/serviceAccounts/n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cloudrun_sa_secret_accessor["deepl-api-key"]: Refreshing state... [id=projects/polycloudops/secrets/deepl-api-key/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cloudrun_sa_secret_accessor["n8n-encryption-key"]: Refreshing state... [id=projects/polycloudops/secrets/n8n-encryption-key/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_connection_string_access: Refreshing state... [id=projects/polycloudops/secrets/n8n-db-connection-string/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_password_access: Refreshing state... [id=projects/polycloudops/secrets/db-password/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db_host_access: Refreshing state... [id=projects/polycloudops/secrets/db-host/roles/secretmanager.secretAccessor/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_cloud_run_v2_service.n8n: Refreshing state... [id=projects/polycloudops/locations/europe-west1/services/n8n-service-staging]
google_storage_bucket_iam_member.cloudrun_storage_admin[0]: Refreshing state... [id=b/polycloudops-n8n-storage-staging/roles/storage.objectAdmin/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com]
google_cloud_run_v2_service_iam_member.noauth[0]: Refreshing state... [id=projects/polycloudops/locations/europe-west1/services/n8n-service-staging/roles/run.invoker/allUsers]
null_resource.bootstrap_n8n: Refreshing state... [id=2938305131873441610]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.n8n must be replaced
-/+ resource "google_cloud_run_v2_service" "n8n" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-03-15T13:03:17.226301Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-03-15T13:03:15.995486Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
            },
        ] -> (known after apply)
      ~ create_time             = "2026-03-15T13:02:49.647997Z" -> (known after apply)
      ~ creator                 = "terraform-sa@polycloudops.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"CPnb2s0GEMjM_rQC/cHJvamVjdHMvcG9seWNsb3Vkb3BzL2xvY2F0aW9ucy9ldXJvcGUtd2VzdDEvc2VydmljZXMvbjhuLXNlcnZpY2Utc3RhZ2luZw\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      ~ last_modifier           = "terraform-sa@polycloudops.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging/revisions/n8n-service-staging-00001-fbb" -> (known after apply)
      ~ latest_ready_revision   = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging/revisions/n8n-service-staging-00001-fbb" -> (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
      ~ name                    = "n8n-service-staging" -> "n8n-service-staging-staging" # forces replacement
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-03-15T13:03:17.249292Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [
          - {
              - percent  = 100
              - revision = ""
              - tag      = ""
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
              - uri      = ""
            },
        ] -> (known after apply)
      ~ uid                     = "0e136f94-9dc6-41c8-8193-a96cf4437188" -> (known after apply)
      ~ update_time             = "2026-03-15T13:02:49.647997Z" -> (known after apply)
      ~ uri                     = "https://n8n-service-staging-ud6xcrkoga-ew.a.run.app" -> (known after apply)
      ~ urls                    = [
          - "https://n8n-service-staging-173389596894.europe-west1.run.app",
          - "https://n8n-service-staging-ud6xcrkoga-ew.a.run.app",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          - session_affinity                 = false -> null
            # (2 unchanged attributes hidden)

          ~ containers {
              - args       = [] -> null
              ~ build_info = [] -> (known after apply)
              - command    = [] -> null
              - depends_on = [] -> null
              ~ image      = "docker.io/n8nio/n8n:2.10.4" -> "n8nio/n8n:2.10.4"

              - env {
                  - name  = "GCS_BUCKET_NAME" -> null
                  - value = "polycloudops-n8n-storage" -> null
                }
              - env {
                  - name  = "GOOGLE_CLOUD_PROJECT" -> null
                  - value = "polycloudops" -> null
                }




                # (27 unchanged blocks hidden)
            }

          ~ scaling {
              ~ min_instance_count = 1 -> 0
                # (1 unchanged attribute hidden)
            }
        }

      ~ traffic {
            # (2 unchanged attributes hidden)
        }
    }

  # google_cloud_run_v2_service_iam_member.noauth[0] must be replaced
-/+ resource "google_cloud_run_v2_service_iam_member" "noauth" {
      ~ etag     = "BwZND7oIWiE=" -> (known after apply)
      ~ id       = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging/roles/run.invoker/allUsers" -> (known after apply)
      ~ name     = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging" -> "n8n-service-staging-staging" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # google_secret_manager_secret_version.db_database will be updated in-place
  ~ resource "google_secret_manager_secret_version" "db_database" {
      - destroy_time           = "" -> null
        id                     = "projects/173389596894/secrets/db-database/versions/16"
        name                   = "projects/173389596894/secrets/db-database/versions/16"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ secret_data            = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # google_secret_manager_secret_version.db_host will be updated in-place
  ~ resource "google_secret_manager_secret_version" "db_host" {
      - destroy_time           = "" -> null
        id                     = "projects/173389596894/secrets/db-host/versions/19"
        name                   = "projects/173389596894/secrets/db-host/versions/19"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ secret_data            = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # google_secret_manager_secret_version.db_user will be updated in-place
  ~ resource "google_secret_manager_secret_version" "db_user" {
      - destroy_time           = "" -> null
        id                     = "projects/173389596894/secrets/db-user/versions/16"
        name                   = "projects/173389596894/secrets/db-user/versions/16"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ secret_data            = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # google_storage_bucket.n8n_storage[0] will be destroyed
  - resource "google_storage_bucket" "n8n_storage" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "environment"                = "staging"
          - "goog-terraform-provisioned" = "true"
          - "managed_by"                 = "terraform"
          - "project"                    = "poly-cloudops"
          - "purpose"                    = "n8n-workflow-storage"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "polycloudops-n8n-storage-staging" -> null
      - labels                      = {
          - "environment" = "staging"
          - "managed_by"  = "terraform"
          - "project"     = "poly-cloudops"
          - "purpose"     = "n8n-workflow-storage"
        } -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "polycloudops-n8n-storage-staging" -> null
      - project                     = "polycloudops" -> null
      - project_number              = 173389596894 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/polycloudops-n8n-storage-staging" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "environment"                = "staging"
          - "goog-terraform-provisioned" = "true"
          - "managed_by"                 = "terraform"
          - "project"                    = "poly-cloudops"
          - "purpose"                    = "n8n-workflow-storage"
        } -> null
      - time_created                = "2026-03-15T13:02:24.606Z" -> null
      - uniform_bucket_level_access = true -> null
      - updated                     = "2026-03-15T13:02:40.229Z" -> null
      - url                         = "gs://polycloudops-n8n-storage-staging" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - lifecycle_rule {
          - action {
              - storage_class = "NEARLINE" -> null
              - type          = "SetStorageClass" -> null
            }

          - condition {
              - age                                     = 90 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
        }
      - lifecycle_rule {
          - action {
              - type = "Delete" -> null
            }

          - condition {
              - age                                     = 365 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
        }

      - soft_delete_policy {
          - effective_time             = "2026-03-15T13:02:24.606Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # google_storage_bucket_iam_member.cloudrun_storage_admin[0] will be destroyed
  - resource "google_storage_bucket_iam_member" "cloudrun_storage_admin" {
      - bucket = "b/polycloudops-n8n-storage-staging" -> null
      - etag   = "CAI=" -> null
      - id     = "b/polycloudops-n8n-storage-staging/roles/storage.objectAdmin/serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:n8n-cloudrun-sa-staging@polycloudops.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectAdmin" -> null
    }

  # neon_project.main will be updated in-place
  ~ resource "neon_project" "main" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ connection_uri            = (sensitive value)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ connection_uri_pooler     = (sensitive value)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ database_password         = (sensitive value)
        id                        = "old-wave-64591209"
        name                      = "poly-cloudops-staging"
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # neon_role.n8n_user will be updated in-place
  ~ resource "neon_role" "n8n_user" {
        id         = "old-wave-64591209/br-falling-leaf-aeroevr7/n8n_app_user"
        name       = "n8n_app_user"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ password   = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # null_resource.bootstrap_n8n must be replaced
-/+ resource "null_resource" "bootstrap_n8n" {
      ~ id       = "2938305131873441610" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "390cedf4a456a2412f61bc9c6bb088fb" -> "75e3631eff88e42afdbe4586a309e2d3"
            # (3 unchanged elements hidden)
        }
    }

  # null_resource.create_translations_table must be replaced
-/+ resource "null_resource" "create_translations_table" {
      ~ id       = "596672327568931296" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "1dbd9c623250fab8ed90b91ad5bbbdb0" -> "3d006bd5c6e890ae685fe3defa6ec677"
            # (3 unchanged elements hidden)
        }
    }

Plan: 4 to add, 5 to change, 6 to destroy.

Changes to Outputs:
  ~ helpful_commands            = {
      ~ describe_service = "gcloud run services describe n8n-service-staging --region=europe-west1" -> "gcloud run services describe n8n-service-staging-staging --region=europe-west1"
      ~ open_n8n         = "open https://n8n-service-staging-ud6xcrkoga-ew.a.run.app" -> (known after apply)
      ~ view_logs        = "gcloud run services logs read n8n-service-staging --region=europe-west1 --limit=50" -> "gcloud run services logs read n8n-service-staging-staging --region=europe-west1 --limit=50"
    }
  ~ n8n_service_latest_revision = "projects/polycloudops/locations/europe-west1/services/n8n-service-staging/revisions/n8n-service-staging-00001-fbb" -> (known after apply)
  ~ n8n_service_name            = "n8n-service-staging" -> "n8n-service-staging-staging"
  ~ n8n_service_url             = "https://n8n-service-staging-ud6xcrkoga-ew.a.run.app" -> (known after apply)
  ~ storage_bucket_name         = "polycloudops-n8n-storage-staging" -> "Not created"
  ~ storage_bucket_url          = "gs://polycloudops-n8n-storage-staging" -> "Not created"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @OuidadM, Action: `pull_request`, Workflow: `Terraform CI/CD Pipeline`*